In [1]:
#Programmer Rutuja Jagtap
# Keystone School of Engineering
# Class:TE(COMP)-A
#Roll no:26

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('student.csv')

In [4]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

Slicing - Index Based

In [7]:
df.iloc[1:5,1:4]

      name class  marks
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28

In [9]:
x=df.iloc[1:4,1:4]
x

      name class  marks
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66

In [12]:
x=df.iloc[1:4] # row slicing
x

   roll     name class  marks  age
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20

In [13]:
df.iloc[:5,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28

In [14]:
df.iloc[4:9,1:]

     name class  marks  age
4    asha    TE  63.28   20
5  ayesha    BE  49.55   20
6    amar    BE  65.34   19
7   amita    BE  68.33   23
8    amol    TE  56.75   20

In [15]:
df.iloc[4:9,:4]

   roll    name class  marks
4     5    asha    TE  63.28
5     6  ayesha    BE  49.55
6     7    amar    BE  65.34
7     8   amita    BE  68.33
8     9    amol    TE  56.75

In [16]:
df.iloc[:,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [18]:
type(x)

pandas.core.frame.DataFrame

In [19]:
df.iloc[[5,7,2,1],:]

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
7     8   amita    BE  68.33   23
2     3  aniket    BE  76.88   19
1     2    amit    TE  59.77   21

In [20]:
df.iloc[[5,7,2,1],[1,3]]

     name  marks
5  ayesha  49.55
7   amita  68.33
2  aniket  76.88
1    amit  59.77

In [21]:
df.iloc[5,:]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [23]:
x=df.iloc[5,:]
dataframe=pd.DataFrame(x)
dataframe

            5
roll        6
name   ayesha
class      BE
marks   49.55
age        20

In [27]:
df.iloc[5]  #exactly 1 row

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [28]:
df.iloc[:,1]  #exactly 1 col

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [30]:
df.iloc[3,1]  # exactly 1 row and 1 col

'ajinkya'

Slicing - Label Based

In [33]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [34]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [35]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [37]:
df[['name','marks','age']]

      name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

In [38]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [39]:
df.marks

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
6    65.34
7    68.33
8    56.75
9    78.66
Name: marks, dtype: float64

In [42]:
df.iloc[list(range(5))+list(range(6,10))]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [43]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [44]:
df.drop([5,8,2])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
9    10    anmol    BE  78.66   21

In [45]:
df.drop('class',axis=1)  #for drop a col

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [46]:
df.drop(['class','age'],axis=1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

function/Method

In [47]:
df['marks'].mean()

64.499

In [48]:
df['marks'].min()

49.55

In [49]:
df['marks'].max()

78.66

In [50]:
df['marks'].sum()

644.9899999999999

In [53]:
df['name'].max()

'ayesha'

In [54]:
df['name'].min()

'ajinkya'

In [55]:
df['name'].sum()

'anilamitaniketajinkyaashaayeshaamaramitaamolanmol'

In [56]:
df['marks'].median()

64.31

In [58]:
df['marks'].std()

9.207178901994535

In [59]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [60]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [61]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [62]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [63]:
df['marks'].mode()

0    49.55
1    56.75
2    56.77
3    59.77
4    63.28
5    65.34
6    68.33
7    69.66
8    76.88
9    78.66
Name: marks, dtype: float64

In [64]:
df['class'].count()

10

In [65]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [66]:
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [67]:
df.median(numeric_only=True)

roll      5.50
marks    64.31
age      20.00
dtype: float64

In [68]:
df.std(numeric_only=True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [70]:
df.mean(numeric_only=True , axis=1)

0    26.590000
1    27.590000
2    32.960000
3    31.220000
4    29.426667
5    25.183333
6    30.446667
7    33.110000
8    28.583333
9    36.553333
dtype: float64

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [72]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000